Config/Catalogs/ВидыДоходовКДБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыДоходовКДБ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подгруппа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подстатья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АналитическиеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АналитическаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ВидыДоходовКДБ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	// Конец ЗапретРедактированияРеквизитовОбъектов
	
	ОбновитьОформлениеПоляКод();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	// Конец ЗапретРедактированияРеквизитовОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.Код) Тогда
		УстановитьКод();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("КлассификаторДоходов.ИзменениеЭлемента",Объект.Ссылка,ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	УстановитьКод();
КонецПроцедуры

&НаКлиенте
Процедура ПодгруппаПриИзменении(Элемент)
	УстановитьКод();
КонецПроцедуры

&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	УстановитьКод();
КонецПроцедуры

&НаКлиенте
Процедура ПодстатьяПриИзменении(Элемент)
	УстановитьКод();
КонецПроцедуры


&НаКлиенте
Процедура ЭлементПриИзменении(Элемент)
	
	УстановитьКод();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаДействияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ПриказыОБК.ФормаВыбора",,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеДействияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ПриказыОБК.ФормаВыбора",,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаДействияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДатаНачалаДействияОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеДействияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОкончаниеДействияОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьКод()
	
	Объект.Код = Объект.Группа + Объект.Подгруппа 
	+ ?(ЗначениеЗаполнено(Объект.Статья), Объект.Статья, "00") 
	+ ?(ЗначениеЗаполнено(Объект.Подстатья), Объект.Подстатья, "000") 
	+ ?(ЗначениеЗаполнено(Объект.Элемент), Строка(Объект.Элемент), "00"); 
	
	ОбновитьОформлениеПоляКод();
КонецПроцедуры	
	
&НаСервере
Процедура ДатаНачалаДействияОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ПриказыОБК") Тогда
		СтандартнаяОбработка = Ложь;
		Объект.ДатаНачалаДействия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ДатаНачала");
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ОкончаниеДействияОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ПриказыОБК") Тогда
		СтандартнаяОбработка = Ложь;
		Объект.ОкончаниеДействия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ДатаНачала") - 86400;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьОформлениеПоляКод()
		
	Латиница = БюджетнаяКлассификацияКлиентСервер.СимволыЛатиницы();
	Кириллица = БюджетнаяКлассификацияКлиентСервер.СимволыКириллицы();
	ЦветЛатиницы = Новый Цвет(0,0,255);
	ЦветКириллицы = WebЦвета.ЗеленыйЛес; 
	
	МассивСтрок = Новый Массив;
	
	ЕстьОформление = Ложь;
	
	ЖирныйШрифт = Новый Шрифт(,,Истина);
	
	Если ЗначениеЗаполнено(Объект.Код) Тогда
				
		Для Инд = 1 По СтрДлина(Объект.Код) Цикл
			ТекБлок = Сред(Объект.Код,Инд,1);
			
			Если Найти(Латиница,ВРег(ТекБлок))>0 Тогда
				ЕстьОформление = Истина;
				ТекущийФорматированныйБлок = Новый ФорматированнаяСтрока(ТекБлок,ЖирныйШрифт,ЦветЛатиницы);
				МассивСтрок.Добавить(ТекущийФорматированныйБлок);
			ИначеЕсли Найти(Кириллица,ВРег(ТекБлок))>0 Тогда
				ЕстьОформление = Истина;
				ТекущийФорматированныйБлок = Новый ФорматированнаяСтрока(ТекБлок,ЖирныйШрифт,ЦветКириллицы);
				МассивСтрок.Добавить(ТекущийФорматированныйБлок);				
			Иначе
				МассивСтрок.Добавить(ТекБлок);	
			КонецЕсли;
						
		КонецЦикла;
		
		МассивСтрок.Добавить(" 0000 ххх");
		
		ТекущийФорматированныйБлок = Новый ФорматированнаяСтрока("  Кир.",ЖирныйШрифт,ЦветКириллицы);
		МассивСтрок.Добавить(ТекущийФорматированныйБлок);
		МассивСтрок.Добавить("/");
		ТекущийФорматированныйБлок = Новый ФорматированнаяСтрока("Лат.",ЖирныйШрифт,ЦветЛатиницы);
		МассивСтрок.Добавить(ТекущийФорматированныйБлок);
	КонецЕсли;
	
	Если ЕстьОформление Тогда
		Элементы.ГруппаСтраницыОформления.ТекущаяСтраница = Элементы.ГруппаОформление;
	Иначе
		Элементы.ГруппаСтраницыОформления.ТекущаяСтраница = Элементы.ГруппаПустая;	
	КонецЕсли;
	
	Элементы.ДекорацияКод.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
КонецПроцедуры

#КонецОбласти
